Enterprise_Serivces/Prod/Bronze2/CSLAssociationService/CSLClientService/result1/Iteration1/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/client/contracts/2010/05/IClientService/AuthenticateClient</wsa:Action><wsa:MessageID>uuid:f6f15bc3-9a56-4a84-98b6-e2bd696c520e</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslclientserviceqa1.testgs.pvt/ClientService.svc</wsa:To></soap:Header><soap:Body><AuthenticateClient xmlns="http://www.gamestop.com/services/csl/client/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><ClientKey xmlns="http://www.gamestop.com/services/csl/client/contracts/messages/2010/05">[ClientKey]</ClientKey><ClientSecret xmlns="http://www.gamestop.com/services/csl/client/contracts/messages/2010/05">[ClientSecret]</ClientSecret></request></AuthenticateClient></soap:Body></soap:Envelope>